"""Загружает все дополнительные обработчики бота.

Дополнительные обработчики используются для расширения базового
функционала бота, а также для группировки исходного кода бота
по функционалу.
"""

# Импортируем все обработчики
from tg.handlers import (
    counters,
    errors,
    intents,
    notify,
    request,
    schedule,
    set_class,
    updates,
)

# Список всех экземпляров роутеров обработчиков
# Вы можете и самостоятельно отключать не нужным вам обработчики
# Однако помните что пункты меню будут на месте.
# Только они останутся безответными.
routers = (
    counters.router,  # Счётчики расписания. Считаются количество элементов.
    errors.router,  # Обработчик ошибок во время работы бота.
    intents.router,  # Редактор пользовательских намерений.
    notify.router,  # Рассылка расписания и изменения в нём.
    schedule.router,  # Получение расписания, один из главных обработчиков.
    set_class.router,  # Выбор класса пользователя
    updates.router,  # Просмотр списка изменений в расписании
    request.router,  # Запросы к расписанию
)

__all__ = ("routers",)
