"""Telegram бот для доступа к расписанию занятий.

Полностью реализует функционал sp.
Не считая некоторых ограничений в настройке "намерений" (Intents).
Также это касается ограничений текстовых сообщений.

Команды бота
------------

sc - Уроки на сегодня/завтра
week - Расписание на неделю
updates - Изменения в расписании
notify - Настроить уведомления
counter - Счётчики уроков/кабинетов
tutorial - Как писать запросы
set_class - Изменить класс
intents - Настроить намерения
add_intent - Добавить намерение
remove_intents - Удалить намерение
help - Главное меню
info - Информация о боте

Author: Milinuri Nirvalen
Ver: 2.7 (sp v6.5)
"""

__version__ = "2.7"
