"""Инструменты для работы с расписанием уроков.

Включает в себя:

- counter: Функции для подсчёта элементов расписания.
- intents: Вспомогательный класс намерения для уточнения результатов
    работы методов расписания.
- messages: Генерато сообщений, для преобразования "сырых" результатов
    работы методов Schedule в текстовые сообщения.
- parser: Самостоятельный парсер школьного расписания и класс Schedule
    для непосредственной работы с расписанием уроков.
- utils: Общие вспомогательные функции.
"""

__version__ = "6.0.1"
