"""Платформа для распространения расписания уроков.

Представляет собой самостоятельный парсер расписания уроков, с
последующим представление данных в виде текстовых сообщений.
Также предоставляет дополнительный функционал для работы с расписанием.

Включает в себя:

- counter: Класс подсчёта элементов расписания (уроки, дни, кабинеты).
- db: Работа с базой данных пользователей.
- enums: Общие перечисление в проекте.
- exceptions: Возникающие в процессе работы исключения.
- intents: Вспомогательный класс для уточнения результатов работы
    методов расписания и генератора сообщений.
- messages: Генератор сообщений, для преобразования "сырых" результатов
    методов класса Schedule в текстовые сообщения.
- parser: Самостоятельный парсер школьного расписания и класс Schedule
    для непосредственной работы с расписанием уроков.
- platform: Более высокоуровневый класс для предоставления доступа ко
    всем компонентам расписания.
- updates: Работа со списком изменений.
- utils: Общие вспомогательные функции.
- version: Определение версии приложения и поиск обновлений.
"""

__version__ = "6.5"
