"""Инструменты для работы с расписанием уроков.

Автономный парсер, а также генератор сообщения для расписаний уроков.
С функицей поиска, отслеживания изменения и подсчёта элементов
расписания.

Включает в себя:

- dev: Компоненты будущего обновления sp_v7.
    - intents: Намерения и цепочки намерений для фильтрации запросов.
    - schedule: Расписание уроков на день, неделю, для классов.
- users: Хранилище пользователей расписания.
    - intents: Хранилище пользовательских намерений.
    - storage: Платформазависимые пользователя расписания.
- counter: Общий счёткич для элементов расписания.
- exceptions: исключения, возникающие во время работы с расписанием.
- intents: Намерение что-то получить от расписания. Уточнаяю запросы.
- messages: Генерато сообщений, для преобразования "сырых" результатов
    работы методов Schedule в текстовые сообщения.
- parser: Самостоятельный парсер школьного расписания и класс Schedule
    для непосредственной работы с расписанием уроков.
- platform: Более высокоуровневый класс для работы со всеми компонентами
    проекта в рамках одной платформы (чат-бот, сайт, сервер...).
- text_counter: Надстройка над счётчиками для выдачи текстовых
    готовых текстовых сообщений.
- utils: Общие вспомогательные функции для всех компонентов.
"""

__version__ = "7.0-Alpha"
