"""Платформа для распространения расписания уроков.

Представляет собой самостоятельный парсер расписания уроков, с
последующим представление данных в виде текстовых сообщений.
Также предоставляет дополнительный функционал для работы с расписанием.

**Включает в себя**:

- provider: Поставщик расписания из стороннего источника.
- view: Представление расписания в различных форматах.
- counter: Класс подсчёта элементов расписания (уроки, дни, кабинеты).
- db: Работа с базой данных пользователей.
- enums: Общие перечисление в проекте.
- intents: Вспомогательный класс для уточнения результатов работы
    методов расписания и генератора сообщений.
- schedule: Реализация расписания уроков.
- timetable: Реализация расписания звонков.
- updates: Работа со списком изменений.
"""

__version__ = "6.5"
