"""Платформа для распространения расписания уроков.

Представляет собой самостоятельный парсер расписания уроков, с
последующим представление данных в виде текстовых сообщений.
Также предоставляет дополнительный функционал для работы с расписанием.

Включает в себя:

- users: Хранилище пользователей расписаниея.
    - storage: Платформозависимоее хранилище пользователей в файле.
    - intents: Хранилище пользовательских намерений.
- counter: Класс подсчёта элементов расписания (уроки, дни, кабинеты).
- intents: Вспомогательный класс для уточнения результатов работы
    методов расписания и генератора сообщений.
- messages: Генерато сообщений, для преобразования "сырых" результатов
    методов класса Schedule в текстовые сообщения.
- parser: Самостоятельный парсер школьного расписания и класс Schedule
    для непосредственной работы с расписанием уроков.
- platform: Более высокоуровневый класс для предосатвления доступа ко
    всем компонентам расписания.
- utils: Общие вспомогательные функции.
"""

__version__ = "6.1"
