"""Платформа для распространения расписания уроков.

Представляет собой самостоятельный парсер расписания уроков, с
последующим представление данных в виде текстовых сообщений.
Также предоставляет дополнительный функционал для работы с расписанием.

Включает в себя:

- users: Хранилище пользователей расписания.
    - storage: Платформа независимое хранилище пользователей в файле.
    - intents: Хранилище пользовательских намерений.
- counter: Класс подсчёта элементов расписания (уроки, дни, кабинеты).
- intents: Вспомогательный класс для уточнения результатов работы
    методов расписания и генератора сообщений.
- messages: Генератор сообщений, для преобразования "сырых" результатов
    методов класса Schedule в текстовые сообщения.
- parser: Самостоятельный парсер школьного расписания и класс Schedule
    для непосредственной работы с расписанием уроков.
- platform: Более высокоуровневый класс для предоставления доступа ко
    всем компонентам расписания.
- utils: Общие вспомогательные функции.
"""

from sp.version import PROJECT_VERSION

__version__ = PROJECT_VERSION.full
