"""Коллекция перечислений.

Перечисления могут использоваться всеми компонентами.
Расположены в одном месте для большего удобства.
"""

from enum import IntEnum

# Используются при обработке дней недели, а также в прочих компонентах
DAY_NAMES = ("понедельник", "вторник", "среда", "четверг", "пятница", "суббота")
SHORT_DAY_NAMES = ("пн", "вт", "ср", "чт", "пт", "сб")


class WeekDay(IntEnum):
    """Перечисление дней недели.

    Методы для обозначения дня недели использую числа от 0 до 5,
    что соответствуем дням недели.
    """

    MONDAY = 0
    TUESDAY = 1
    WEDNESDAY = 2
    THURSDAY = 3
    FRIDAY = 4
    SATURDAY = 5

    def to_str(self) -> str:
        """Возвращает день недели как строку: Понедельник - суббота."""
        return DAY_NAMES[self.value]

    def to_short_str(self) -> str:
        """Возвращает день недели как короткую строку: пн - сб."""
        return SHORT_DAY_NAMES[self.value]
