"""Коллекция всех возможнвх исключений платформы.

Изместно что во время работы что-то может пойти не так.
Для того чтобы помочь описать что пошло не так, представляем исключения.
"""


# View
# ====

class ViewCompatibleError(Exception):
    """Если версии API не совпадают.

    Может возникнуть при подключении класса представления к платформе.

    Возникает если API версия платформы оказывается выше, чем у
    класса представления.
    Предполагается что API платформы будет или ниже или равен
    API представления.
    """

    pass

class ViewSelectedError(Exception):
    """Если вы захотели использовать view, но она не была настроена.

    При работе с платформой вы будете не раз обращаться к классу
    предствления.
    До того как вы сможете использовать класс представления, вам
    нужно его установить через специальный сеттер.
    Но если класс представления не был установлен и ыв захотели его
    использовать, то получите данное исключение.
    """

    pass
