"""Коллекция всех исключений проета.

Изместно что во время работы что-то может пойти не так.
для более точного описания исключения и существует данная колекция.

Исключения были собраны в одном месте для удобства.
Посколько компоненты расписания могут состоять не из одного файла и
не всегда понятно, где могут находиться исключения дл конкретного
компонента.
"""

# Intents
# =======

class ParseIntentError(Exception):
    """Если не удалось распаковать намерение из строки.

    Возникает когад допущена ошибка в формате строки, при использовании
    метода ``Intent.unpack()``.
    """

    pass


# View
# ====

class ViewCompatibleError(Exception):
    """Если версии API не совпадают.

    Может возникнуть при подключении класса представления к платформе.

    Возникает если API версия платформы оказывается выше, чем у
    класса представления.
    Предполагается что API платформы будет или ниже или равен
    API представления.
    """

    pass

class ViewSelectedError(Exception):
    """Если вы захотели использовать view, но она не была настроена.

    При работе с платформой вы будете не раз обращаться к классу
    предствления.
    До того как вы сможете использовать класс представления, вам
    нужно его установить через специальный сеттер.
    Но если класс представления не был установлен и ыв захотели его
    использовать, то получите данное исключение.
    """

    pass
