"""Telegram бот для доступа к SPMessages.

Полностью реализует доступ ко всем методам SPMessages.
Не считая некоторых ограничений в настройке "намерений" (Intents).
Также это касается ограничений текстовых сообщений.

Команды бота для BotFather
--------------------------

sc - Уроки на сегодня/завтра
updates - Изменения в расписании
notify - Настроить уведомления
counter - Счётчики уроков/кабинетов
tutorial - Как писать запросы
set_class - Изменить класс
intents - Настроить намерения
add_intent - Добавить намерение
remove_intents - Удалить намерение
help - Главное меню
info - Информация о боте

Author: Milinuri Nirvalen
Ver: 2.5 (sp v6.1)
"""

__version__ = "2.5"
